{
  "title": "Augusta County: John Scott to Samuel Hunt, June 2, 1866",
  "summary": "Scott announces the arrival of AMA teacher C. E. Dewey and comments on a native Virginian and \"presiding Elder from the north\" who \"sympathizes with us in our work.\" Scott contends that this Elder \"advises me to write concerning the importance of your work in the valley above other places. He says 'They have more energy and influence' in this valley than in any other part of Va. Even the whole South with which he is acquainted.'\" [Article attached to page 3 of letter reads: For the \"Valley Virginian.\" A Card of Thanks from the Colored People SIR:-- The members of the colored M. E. Church, through the columns of the Virginian would take occasion to thank the white citizens, of Staunton, for their valuable aid at a Fair recently held by them. We would take occasion to inform the citizens of Staunton, that we have in our midst, one Emily Rodney, of Pennsylvania, of the Bethel Church, soliciting subscriptions under a false misrepresentation of facts, and would say, that if the white citizens feel disposed to further aid us in paying for our Church, they will please be careful who they pay money to, as we have been informed several gentlemen have contributed, thinking it was for the benefit of the M. E. Church, Colored, when it was intended for the Bethel Church. They regret to learn that an impression seems to exist among the citizens that the colored people wish to \"draw out from among the whites,\" and in church and business matters, become independent of them; thus acknowledging little obligation to them. We are sorry to hear that this doctrine is taught by some of our color from the North, who are endeavoring to form a sect, new to us, here, but so far as that is concerned we have no sympathy with them. We do not desire this foolish independence, but are very thankful for sympathy and aid from the whites, and respectfully acknowledge our obligations. Rev. E. Lawson, Pastor; James Scott, Local Preacher; Phillip Rosshell, Exhorter; Henry Davenport, Aaron Shoveler, Frances Overton, Phillip Ransome, Oscar Morris, Adison King, F. Parris, Thos. Campbell, William Benny, James Carter, John Harris, John Napper, Nelson Shelton and David Devenport. To Major A. M. Garber, Jr., Editor of the \"Valley Virginian\"} ]",
  "keywords": "African Americans, Education, Church/Religious Activity, Women, American Civil War",
  "source_file": "api.valley.newamericanhistory.org/storage/data/papers/A7122.xml",
  "content_file": "content/p025_004.html"
}